{
    "intents":[
        {
            "tag": "mercuryOverview",
            "patterns": [
                "Can we go to Mercury?",
                "Take me to Mercury.",
                "Let's visit Mercury.",
                "I want to see Mercury.",
                "Show me the first planet.",
                "Fly to Mercury with me.",
                "Visit the closest planet to the Sun.",
                "Explore Mercury together.",
                "I'd like to travel to Mercury.",
                "Can we have a tour of Mercury?",
                "Let's go see Mercury.",
                "Journey to Mercury.",
                "Space trip to Mercury.",
                "Head to Mercury.",
                "Discover Mercury.",
                "Tell me about Mercury.",
                "What's Mercury like?",
                "Describe Mercury.",
                "Facts about Mercury.",
                "Why is Mercury interesting?",
                "Information on Mercury.",
                "Characteristics of Mercury.",
                "What makes Mercury unique?",
                "How is Mercury different?",
                "Mercury's features.",
                "Lets go to the first planet",
                "What is the 1st planet?",
                "Murcury"
            ],
            "responses": [
                "Prepare for an adventure to Mercury, the smallest planet and closest to the Sun, boasting a landscape like no other with its pockmarked surface and wild temperature swings. As we journey closer, we'll uncover a rocky world with no moons and an atmosphere so thin, it's called an exosphere, setting the stage for dramatic temperature fluctuations. Despite its petite size, Mercury is a land of extremes, with scorching hot days, bone-chilling nights, and a terrain scarred by countless craters, making it a truly mesmerizing destination. And here's a fascinating fact: a day on Mercury actually lasts longer than its year, thanks to its slow spin and speedy orbit around the Sun. So, get ready to explore this captivating world where every moment is filled with wonder and discovery!"
            ],
            "image_url": ["https://images-assets.nasa.gov/image/PIA11406/PIA11406~orig.jpg"]
        },
        {
            "tag": "mercuryFacts",
            "patterns": [
                "Cool facts about Mercury.",
                "Fun facts about Mercury.",
                "What's unique about Mercury?",
                "Amazing Mercury details.",
                "Interesting things about Mercury.",
                "Tell me something about Mercury.",
                "Why is Mercury special?",
                "Mercury's unique features.",
                "Fascinating facts about Mercury.",
                "Unusual facts about Mercury."
            ],
            "responses": [
                "Did you know Mercury is the fastest planet, zooming around the Sun in just 88 days?",
                "Mercury has extreme temperatures, super hot in the day and freezing at night!",
                "Mercury is the smallest planet in our solar system, even smaller than some of the moons!",
                "On Mercury, a single day is longer than a whole year because it rotates very slowly.",
                "Mercury is the only planet other than Earth with a global magnetic field."
            ],
            "image_url": ["https://images-assets.nasa.gov/image/PIA11406/PIA11406~orig.jpg"]
        }
        ,
        {
            "tag": "mercuryExploration",
            "patterns": [
                "Have we explored Mercury?",
                "Missions to Mercury.",
                "Discoveries about Mercury.",
                "Exploring Mercury.",
                "Spacecrafts that visited Mercury.",
                "What have we learned about Mercury?",
                "Mercury research missions.",
                "History of Mercury exploration.",
                "Latest mission to Mercury.",
                "Scientific studies on Mercury."
            ],
            "responses": [
                "We've launched spacecraft like Messenger on thrilling missions to unravel the mysteries of Mercury and its enigmatic surface. Through these bold explorations, we've gained valuable insights into its rugged terrain, marked by countless craters, and the extreme temperatures that define its landscape. The Messenger mission, in particular, circled Mercury, beaming back invaluable data about its geology and atmosphere, shedding light on its secrets. And the adventure doesn't end there - BepiColombo, a collaborative effort between Europe and Japan, is currently en route to delve even deeper into Mercury's mysteries. These groundbreaking missions are key to deciphering Mercury's magnetic field and its incredibly tenuous atmosphere, bringing us closer to understanding this intriguing world."
            ],
            "image_url": ["https://images-assets.nasa.gov/image/PIA11406/PIA11406~orig.jpg"]
        }       
    ]
}
